// hypots.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>

#include "math.h"
#include "smal_hypots.h"


int main()
{
    smal_hypots16_t ht16;
    int16_t x,y;
    uint16_t h;
    float f;

    x = 0x200;
    for( y=-0x3ff; y<0x400; y++) {
	smal_hypots16( &ht16, &h, x, y);
	f = hypotf( x, y);
	printf("x=0x%04x x=0x%04x h=0x%x f=0x%x(diff:%d)\n", x, y, h, (int)f, ((int)f - h));
    }

    return 0;
}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
